stressTest/serverArtillery.yml
config:
  target: 'http://127.0.0.1:3001'
  phases:
    - duration: 60
      arrivalRate: 500
  # processor: "./reviews.js"
  processor: "./randomRestaurant.js"
scenarios:
  - flow:
    - function: "randomRestaurant"
    - get:
        url: "/api/reviews/restaurants/{{random}}/reviews"
    # - function: "randomReview"
    # - post:
    #     url: "/api/reviews/restaurants/{{random}}/reviews"
    #     json: "{{userReview}}"